In [9]:

from sqlalchemy import create_engine
import pandas as pd

# Define connection parameters
user = "root"
password = "root"
host = "localhost"
port = "3306"
database = "phonepe"

# Create SQLAlchemy engine
engine = create_engine(f"mysql+pymysql://{user}:{password}@{host}:{port}/{database}")

# Connect to the database
conn = engine.connect()

# Case Study 1:Insurance_Insights Districts Vs Transaction Amount 
query1 = """
 SELECT districts, 
    ROUND(SUM(Transactions_amount)/1000000000000,5) AS Trans_Amount_Trillion
    from top_trans group by districts ORDER BY 
    Trans_Amount_Trillion DESC limit  20;
    
    """
   
# Execute query and load into DataFrame
df8 = pd.read_sql(query1, conn)
df8['query'] = 'query1'

In [10]:
df8

             districts  Trans_Amount_Trillion   query
0      bengaluru urban               19.93784  query1
1            hyderabad               11.90694  query1
2                 pune                9.73022  query1
3               jaipur                7.85409  query1
4           rangareddy                7.15514  query1
5   medchal malkajgiri                5.75888  query1
6        visakhapatnam                4.19857  query1
7               guntur                3.17453  query1
8                patna                3.11076  query1
9              khordha                2.99215  query1
10       east godavari                2.97549  query1
11             krishna                2.97506  query1
12     mumbai suburban                2.89891  query1
13              indore                2.85136  query1
14              bhopal                2.84899  query1
15       central delhi                2.79989  query1
16            chittoor                2.67128  query1
17             kolkata                2.65547  query1
18              nashik                2.61829  query1
19               thane                2.53980  query1

In [17]:
# Case Study 2:Insurance_Insights State Vs Transaction Count 
query2 = """
SELECT 
    State, 
    ROUND(SUM(Transactions_count)/1000000000,2) AS Transactions_Count_Crore
 FROM 
    top_trans
GROUP BY 
    State
ORDER BY 
    Transactions_Count_Crore DESC
LIMIT 10;
    
    """
      
# Execute query and load into DataFrame
df9 = pd.read_sql(query2, conn)
df9['query'] = 'query2'

In [18]:
df9

            State  Transactions_Count_Crore   query
0       karnataka                     24.19  query2
1     maharashtra                     23.25  query2
2       telangana                     21.13  query2
3  andhra-pradesh                     15.25  query2
4       rajasthan                     11.21  query2
5   uttar-pradesh                      8.68  query2
6           delhi                      8.16  query2
7  madhya-pradesh                      8.11  query2
8     west-bengal                      6.84  query2
9          odisha                      6.17  query2

In [19]:
from numpy import concat

# Step 3: Combine all results into one CSV
insu_top_combined_df = pd.concat([df8, df9], ignore_index=True)
insu_top_combined_df.fillna('', inplace=True)
insu_top_combined_df.to_csv("insu_top_case_combined.csv", index=False)


print("case1_combined.csv created successfully!")

case1_combined.csv created successfully!

C:\Users\Adhiran\AppData\Local\Temp\ipykernel_13504\1155388629.py:5: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  insu_top_combined_df.fillna('', inplace=True)

In [16]:
insu_top_combined_df

,districts,Trans_Amount_Trillion,query,State,Transactions_Count_Crore
0,bengaluru urban,19.93784,query1,,
1,hyderabad,11.90694,query1,,
2,pune,9.73022,query1,,
3,jaipur,7.85409,query1,,
4,rangareddy,7.15514,query1,,
5,medchal malkajgiri,5.75888,query1,,
6,visakhapatnam,4.19857,query1,,
7,guntur,3.17453,query1,,
8,patna,3.11076,query1,,
9,khordha,2.99215,query1,,
10,east godavari,2.97549,query1,,
11,krishna,2.97506,query1,,
12,mumbai suburban,2.89891,query1,,
13,indore,2.85136,query1,,
14,bhopal,2.84899,query1,,
15,central delhi,2.79989,query1,,
16,chittoor,2.67128,query1,,
17,kolkata,2.65547,query1,,
18,nashik,2.61829,query1,,
19,thane,2.5398,query1,,
20,,,query2,karnataka,24.19
21,,,query2,maharashtra,23.25
22,,,query2,telangana,21.13
23,,,query2,andhra-pradesh,15.25
24,,,query2,rajasthan,11.21
25,,,query2,uttar-pradesh,8.68
26,,,query2,delhi,8.16
27,,,query2,madhya-pradesh,8.11
28,,,query2,west-bengal,6.84
29,,,query2,odisha,6.17
30,,,query2,bihar,5.84
31,,,query2,haryana,5.54
32,,,query2,tamil-nadu,5.42
33,,,query2,gujarat,5.35
34,,,query2,jharkhand,3.36
35,,,query2,chhattisgarh,2.77
36,,,query2,kerala,2.05
37,,,query2,assam,1.44
38,,,query2,punjab,1.43
39,,,query2,uttarakhand,1.42